Tarea1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0 0 0)            //vertice 0
    (3 0 0)            //vertice 1
    (3 0.2 0)          //vertice 2
    (0 0.2 0)          //vertice 3  
    (0 0 0.2)          //vertice 4
    (3 0 0.2)          //vertice 5
    (3 0.2 0.2)     //vertice 6
    (0 0.2 0.2)     //vertice 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) 
    (100 10 1) 
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );

    }
    upperWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );      
    }
    lowerWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );        
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );  
    }

);

// **************************************************************** //  